run/pressureBuildupFoam/SumerExample_b/constant/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      materialProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


K              K [ 1 -1 -2 0 0 0 0 ] 1.9e9;

Sr             Sr [ 0 0 0 0 0 0 0 ] 1;

nu             nu [ 0 0 0 0 0 0 0 ] 0.35;

p0             p0 [ 1 -1 -2 0 0 0 0 ] 186390.0;

gamma          gamma [ 1 -2 -2 0 0 0 0 ] 0.981e4;

planeStress    no;

// ************************************************************************* //
